Revit 2027 API
DividedPath.MinimumDistance Property
 The minimum distance is used when the layout is set to 'MinimumSpacing'. When that layout rule is used the distance between points will not fall below this value. The measurement type determines how the distance is measured.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MinimumDistance { get; set; }
Public Property MinimumDistance As Double
	Get
	Set
public:
property double MinimumDistance {
	double get ();
	void set (double value);
}
member MinimumDistance : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The minimumDistance is too small.
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace